export default class Res {
  static headerTitle = "تقطيع";
  static topCaption = "اس آلے کے ذریعے اردو شعروں کی تقطیع کی جا سکتی ہے";
  static resultCaption = "نتائج";
  static captionSrcLink = "مأخذ";
  static modalCaption = "انگریزی کلیدوں سے اردو حروف لکھنے کا نقشہ";
  static warningModalCaption = "انتباہ";
  static warningModalMessage =
    "تقطیع جانچنے کے لئے کم سے کم ایک مصرعہ لکھنا ضروری ہے";
  static modalHoverText = "Mapping of English keys to Urdu letters";
  static enterBtnCaption = "درج کریں";
  static keyLayoutBtnCaption = "نقشۂ حروف";
  static captionInfoBtn = "معلومات";
  static captionSamplesBtn = "نمونہ دیکھیں";
  static placeHolderText = "اشعار یہاں لکھیں...";
  static parseFailedMessage = "تقطیع ناکام";
  static parseExceptionMessage = "فنّی خرابی کی وجہ سے نتائج نہ مِل سکے";
  static helpText =
    "تقطیع کے دوران ہر لفظ کو ہجّائے کوتاہ اور ہجّائے بلند میں تقسیم کیا جاتا ہے۔ نتائج میں کسی لفظ کے نیچے = کی علامت سے اُس میں شامل ہجّائے بلند کی موجودگی ظاہر ہو گی اور - کی علامت سے ہجّائے کوتاہ کی موجودگی۔ مثلاً سیف کا وزن =- سے ظاہر کیا جائے گااور اسد کا وزن -= سے۔";

  static samples = [
    "نور دیکھا اُس کا ہر سُو پھر بھی وہ مستور ہے\nجلوہ تو کیا ہوگا اُس کا جِس کا پردہ نور ہے",
    "متنِ زیست تو سارا بے نمود لگتا ہے\nدردِ بے نہایت کا حاشیہ نہ ہونے سے",
    "نہ ہوش اپنا نہ ہم نشیں کا نہ جانِ زار و دلِ حزیں کا\nخیال ہر دم ہے اِک حسیں کا کسی کی مجھ کو خبر نہیں ہے",
    "وہ ہجر کے پردے میں جس وقت کہ واصل تھا\nاِس درجہ لطافت تھی اِحساس بھی مشکل تھا",
    "مری سمت سے اسے اے صبا یہ پیامِ آخرِ غم سُنا\nابھی دیکھنا ہو تو دیکھ جا کہ خزاں ہے اپنی بہار پر",
    "ترے ہاتھ سے زیرِ تعمیر ہوں میں\nمبارک مجھے میری ویرانیاں ہیں",
    "درد منّت کشِ دوا نہ ہوا\nمیں نہ اچّھا ہوا بُرا نہ ہوا",
    "سُنائے گی تمہیں رو رو کے سوزِ غم کا افسانہ\nکوئی شب پوچھنا احوال میرا شمعِ محفل سے",
    "تو نے دیکھی ہی نہیں دشتِ وفا کی تصویر\nنوکِ ہر خار پہ اک قطرۂ خوں ہے یوں ہے",
    "پھر دیکھیے اندازِ گل افشانیٔ گفتار\nرکھ دے کوئی پیمانۂ صہبا مرے آگے",
    "خزاں ہو صحنِ تصوّر میں باریاب کہاں\nکہ تیری یاد ہے یاں گل بکَف صبا انداز",
    "وقت سے پوچھ رہا ہے کوئی\nزخم کیا واقعی بھر جاتے ہیں؟",
    "جانِ جاں راحتِ جاں کیا ہے بجُز حسنِ شعور\nروح کا رقصِ طرب چاہیے ویرانے میں",
    "تیرا خلوصِ دلبری جان نہ ڈال دے اگر\nنغمہ بھی میرا مضمحل نالہ بھی میرا بے اثر",
    "لہو کے گھونٹ پینا اور جینا\nمسلسل اک مزہ ہے اور میں ہُوں",
    "کچھ قفس میں ان دنوں لگتا ہے جی\nآشیاں اپنا ہوا برباد کیا",
    "ایسا بھی کوئی کرتا ہے اہلِ وفا کے ساتھ\nتُم ہم سے پیش آئے نہایت بری طرح",
    "اب گریباں کہیں سے چاک نہیں\nشغلِ فصلِ بہار تھا، نہ رہا",
    "دل ہے وہ موم ملا ہے جسے شمعوں کا گداز\nاب کوئی دیکھے نہ دیکھے یوں ہی جلنا ٹھہرا",
    "ابھی اس راہ میں کچھ نقشِ قدم ملتے ہیں\nشہرِ جاناں کو ابھی دُور بہت دُور سمجھ",
    "ہم پر یہ سختی کی نظر، ہم ہیں فقیرِ رہگُزر\nرستہ کبھی روکا ترا دامن کبھی تھاما ترا",
    "ہے شعر آفریں اُس کی ہر ہر ادا\nوہ چاہے لگاوٹ ہو چاہے جفا",
    "اہلِ قفس کا اور تو کچھ بس نہ چل سکا\nآہیں بھریں نسیمِ گلستاں کے ساتھ ساتھ",
    "وادیٔ کہسار میں غرقِ شفق ہے سحاب\nلعلِ بدخشاں کے ڈھیر چھوڑ گیا آفتاب",
    "چڑھیں دار پر ہم چڑھیں طور پر ہم\nرسائی سے بالا ہے بامِ محبّت",
    "یہ نوِید اَوروں کو جا سُنا، ہم اسیرِ دام ہیں، اے صبا\nہمیں کیا چمن ہے جو رنگ پر، ہمیں کیا جو فصلِ بہار ہے",
    "اب رسمِ ربط اٹھ ہی گئی ورنہ پیش ازیں\nبیٹھے ہی رہتے تھے بہم احباب روز و شب",
    "نَدیم ہو تیرا حرفِ شیریں\nتو رنگ پر آئے رنگِ بادہ",
    "مرے شب گزیدہ مُسافرو نئے مہر و ماہ تراش لو\nنہ فضاؤں میں کوئی چاند ہے، نہ ہے آفتاب مدار پر"
  ];
  static charMapping = {
    q: "ق",
    w: "و",
    e: "ع",
    r: "ر",
    t: "ت",
    y: "ے",
    u: "ئ",
    i: "ی",
    o: "ہ",
    p: "پ",
    a: "ا",
    s: "س",
    d: "د",
    f: "ف",
    g: "گ",
    h: "ھ",
    j: "ج",
    k: "ک",
    l: "ل",
    z: "ز",
    x: "ش",
    c: "چ",
    v: "ط",
    b: "ب",
    n: "ن",
    m: "م",
    "`": "ً",
    ",": "،",
    ".": "۔",
    Q: "ْ",
    W: "ّ",
    E: "ٰ",
    R: "ڑ",
    T: "ٹ",
    Y: "َ",
    U: "ء",
    I: "ِ",
    O: "ۃ",
    P: "ُ",
    A: "آ",
    S: "ص",
    D: "ڈ",
    G: "غ",
    H: "ح",
    J: "ض",
    K: "خ",
    Z: "ذ",
    X: "ژ",
    C: "ث",
    V: "ظ",
    N: "ں",
    M: "٘",
    "~": "ٍ",
    "?": "؟",
    "|": "ؔ",
    F: "ٔ",
    L: "ل",
    B: "ب"
  };
}
